app/controllers/api/sessions_controller.rb

  def create
    @user = User.find_by(email: session_params[:email])

    if @user.try(:authenticate, session_params[:password])
      render json: { token: Token.create_for_user(@user), message: "Logged in" }
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "john@example.com"]]
INSERT INTO "tokens" ("user_id", "value", "expires_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)